inventory_service_perf/wrk_report/inventory_python311_write_900.txt
next_player_id is achive 100000 and reset to 1
Running 2m test @ http://eniac-bench:8080
  1 threads and 100 connections
  Thread calibration: mean lat.: 48.402ms, rate sampling interval: 373ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.28ms   11.48ms 308.22ms   92.11%
    Req/Sec     0.90k    28.41     1.06k    79.86%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    6.18ms
 75.000%   11.12ms
 90.000%   18.90ms
 99.000%   62.27ms
 99.900%  117.76ms
 99.990%  255.10ms
 99.999%  292.10ms
100.000%  308.48ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.677     0.000000            1         1.00
       4.311     0.100000         9895         1.11
       4.795     0.200000        19777         1.25
       5.195     0.300000        29569         1.43
       5.611     0.400000        39495         1.67
       6.179     0.500000        49326         2.00
       6.615     0.550000        54206         2.22
       7.247     0.600000        59131         2.50
       8.167     0.650000        64062         2.86
       9.391     0.700000        68990         3.33
      11.119     0.750000        73914         4.00
      12.303     0.775000        76380         4.44
      13.551     0.800000        78839         5.00
      14.703     0.825000        81303         5.71
      15.847     0.850000        83782         6.67
      17.151     0.875000        86241         8.00
      17.919     0.887500        87474         8.89
      18.895     0.900000        88697        10.00
      20.287     0.912500        89927        11.43
      22.511     0.925000        91160        13.33
      25.439     0.937500        92390        16.00
      27.151     0.943750        93006        17.78
      29.103     0.950000        93622        20.00
      31.647     0.956250        94234        22.86
      34.495     0.962500        94861        26.67
      37.727     0.968750        95466        32.00
      39.647     0.971875        95774        35.56
      42.047     0.975000        96083        40.00
      44.415     0.978125        96394        45.71
      47.519     0.981250        96702        53.33
      51.679     0.984375        97007        64.00
      53.663     0.985938        97162        71.11
      56.223     0.987500        97317        80.00
      59.583     0.989062        97468        91.43
      63.519     0.990625        97622       106.67
      67.263     0.992188        97780       128.00
      68.415     0.992969        97853       142.22
      69.823     0.993750        97930       160.00
      70.847     0.994531        98009       182.86
      72.575     0.995313        98084       213.33
      74.687     0.996094        98162       256.00
      76.223     0.996484        98199       284.44
      77.951     0.996875        98238       320.00
      79.487     0.997266        98276       365.71
      81.599     0.997656        98315       426.67
      87.935     0.998047        98353       512.00
      93.503     0.998242        98372       568.89
      98.879     0.998437        98392       640.00
     104.063     0.998633        98411       731.43
     111.231     0.998828        98430       853.33
     118.207     0.999023        98449      1024.00
     121.599     0.999121        98459      1137.78
     127.039     0.999219        98469      1280.00
     131.839     0.999316        98478      1462.86
     137.087     0.999414        98488      1706.67
     142.335     0.999512        98497      2048.00
     146.815     0.999561        98502      2275.56
     156.031     0.999609        98507      2560.00
     164.351     0.999658        98512      2925.71
     178.175     0.999707        98517      3413.33
     188.031     0.999756        98521      4096.00
     195.583     0.999780        98524      4551.11
     197.887     0.999805        98526      5120.00
     209.791     0.999829        98529      5851.43
     210.303     0.999854        98531      6826.67
     246.527     0.999878        98533      8192.00
     255.103     0.999890        98535      9102.22
     264.447     0.999902        98536     10240.00
     266.495     0.999915        98537     11702.86
     266.751     0.999927        98538     13653.33
     267.007     0.999939        98539     16384.00
     267.775     0.999945        98541     18204.44
     267.775     0.999951        98541     20480.00
     267.775     0.999957        98541     23405.71
     270.335     0.999963        98542     27306.67
     270.335     0.999969        98542     32768.00
     285.439     0.999973        98543     36408.89
     285.439     0.999976        98543     40960.00
     285.439     0.999979        98543     46811.43
     292.095     0.999982        98544     54613.33
     292.095     0.999985        98544     65536.00
     292.095     0.999986        98544     72817.78
     292.095     0.999988        98544     81920.00
     292.095     0.999989        98544     93622.86
     308.479     0.999991        98545    109226.67
     308.479     1.000000        98545          inf
#[Mean    =       10.278, StdDeviation   =       11.477]
#[Max     =      308.224, Total count    =        98545]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  107820 requests in 2.00m, 19.13MB read
Requests/sec:    898.50
Transfer/sec:    163.20KB