inventory_service_perf/wrk_report/inventory_python312_initial_fill_1k.txt
next_player_id is achive 100000 and reset to 1
next_player_id is achive 100000 and reset to 1
next_player_id is achive 100000 and reset to 1
[...]
Running 10m test @ http://eniac-bench:8080
  1 threads and 100 connections
  Thread calibration: mean lat.: 110.444ms, rate sampling interval: 570ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    45.97ms   92.31ms   1.15s    91.13%
    Req/Sec     1.00k    51.24     1.16k    81.04%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    9.76ms
 75.000%   33.89ms
 90.000%  120.57ms
 99.000%  480.51ms
 99.900%  715.78ms
 99.990%  966.14ms
 99.999%    1.13s 
100.000%    1.15s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.315     0.000000            1         1.00
       6.483     0.100000        58983         1.11
       7.903     0.200000       117900         1.25
       8.559     0.300000       177533         1.43
       9.079     0.400000       236623         1.67
       9.759     0.500000       294902         2.00
      10.463     0.550000       324439         2.22
      12.527     0.600000       353756         2.50
      15.695     0.650000       383176         2.86
      21.615     0.700000       412697         3.33
      33.887     0.750000       442187         4.00
      41.439     0.775000       456881         4.44
      50.879     0.800000       471632         5.00
      64.383     0.825000       486351         5.71
      79.103     0.850000       501147         6.67
      94.143     0.875000       515823         8.00
     106.367     0.887500       523194         8.89
     120.575     0.900000       530552        10.00
     140.543     0.912500       537929        11.43
     168.191     0.925000       545314        13.33
     199.167     0.937500       552691        16.00
     217.087     0.943750       556353        17.78
     237.823     0.950000       560043        20.00
     262.911     0.956250       563722        22.86
     289.279     0.962500       567424        26.67
     318.463     0.968750       571098        32.00
     334.847     0.971875       572931        35.56
     353.023     0.975000       574790        40.00
     372.223     0.978125       576609        45.71
     394.751     0.981250       578464        53.33
     420.863     0.984375       580291        64.00
     436.735     0.985938       581222        71.11
     452.863     0.987500       582138        80.00
     469.503     0.989062       583061        91.43
     488.703     0.990625       583982       106.67
     510.463     0.992188       584898       128.00
     523.519     0.992969       585360       142.22
     538.111     0.993750       585823       160.00
     553.471     0.994531       586280       182.86
     569.343     0.995313       586744       213.33
     587.775     0.996094       587201       256.00
     598.527     0.996484       587438       284.44
     609.279     0.996875       587663       320.00
     620.031     0.997266       587892       365.71
     634.879     0.997656       588120       426.67
     654.335     0.998047       588347       512.00
     665.599     0.998242       588466       568.89
     674.303     0.998437       588577       640.00
     688.639     0.998633       588699       731.43
     702.463     0.998828       588809       853.33
     718.335     0.999023       588924      1024.00
     726.527     0.999121       588981      1137.78
     741.375     0.999219       589040      1280.00
     757.247     0.999316       589098      1462.86
     771.071     0.999414       589155      1706.67
     788.991     0.999512       589214      2048.00
     796.671     0.999561       589240      2275.56
     805.887     0.999609       589271      2560.00
     814.079     0.999658       589297      2925.71
     831.487     0.999707       589326      3413.33
     863.231     0.999756       589355      4096.00
     883.711     0.999780       589369      4551.11
     900.095     0.999805       589383      5120.00
     919.039     0.999829       589398      5851.43
     941.055     0.999854       589412      6826.67
     958.975     0.999878       589427      8192.00
     964.095     0.999890       589435      9102.22
     968.191     0.999902       589441     10240.00
     972.799     0.999915       589448     11702.86
     980.479     0.999927       589455     13653.33
     987.647     0.999939       589463     16384.00
     989.183     0.999945       589467     18204.44
    1001.983     0.999951       589470     20480.00
    1019.903     0.999957       589473     23405.71
    1043.967     0.999963       589477     27306.67
    1053.695     0.999969       589481     32768.00
    1055.743     0.999973       589482     36408.89
    1061.887     0.999976       589484     40960.00
    1062.911     0.999979       589486     46811.43
    1067.007     0.999982       589488     54613.33
    1120.255     0.999985       589490     65536.00
    1120.255     0.999986       589490     72817.78
    1122.303     0.999988       589491     81920.00
    1132.543     0.999989       589493     93622.86
    1132.543     0.999991       589493    109226.67
    1138.687     0.999992       589494    131072.00
    1138.687     0.999993       589494    145635.56
    1139.711     0.999994       589495    163840.00
    1139.711     0.999995       589495    187245.71
    1144.831     0.999995       589496    218453.33
    1144.831     0.999996       589496    262144.00
    1144.831     0.999997       589496    291271.11
    1146.879     0.999997       589497    327680.00
    1146.879     0.999997       589497    374491.43
    1146.879     0.999998       589497    436906.67
    1146.879     0.999998       589497    524288.00
    1146.879     0.999998       589497    582542.22
    1148.927     0.999998       589498    655360.00
    1148.927     1.000000       589498          inf
#[Mean    =       45.968, StdDeviation   =       92.309]
#[Max     =     1147.904, Total count    =       589498]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  599794 requests in 10.00m, 107.54MB read
Requests/sec:    999.65
Transfer/sec:    183.53KB